night-ghost/MightyCore/avr/bootloaders/atmega/ATmegaBOOT_168_atmega644.hex.S

ATmegaBOOT_168_atmega644.elf:     file format elf32-avr

Sections:
Idx Name          Size      VMA       LMA       File off  Algn
  0 .data         00000002  00800100  0000fdaa  0000063e  2**0
                  CONTENTS, ALLOC, LOAD, DATA
  1 .text         000005aa  0000f800  0000f800  00000094  2**1
                  CONTENTS, ALLOC, LOAD, READONLY, CODE
  2 .bss          0000010b  00800102  00800102  00000640  2**0
                  ALLOC
  3 .comment      00000011  00000000  00000000  00000640  2**0
                  CONTENTS, READONLY
  4 .note.gnu.avr.deviceinfo 00000040  00000000  00000000  00000654  2**2
                  CONTENTS, READONLY
  5 .debug_aranges 00000028  00000000  00000000  00000694  2**0
                  CONTENTS, READONLY, DEBUGGING
  6 .debug_info   00000e97  00000000  00000000  000006bc  2**0
                  CONTENTS, READONLY, DEBUGGING
  7 .debug_abbrev 0000094b  00000000  00000000  00001553  2**0
                  CONTENTS, READONLY, DEBUGGING
  8 .debug_line   000002af  00000000  00000000  00001e9e  2**0
                  CONTENTS, READONLY, DEBUGGING
  9 .debug_frame  000000f0  00000000  00000000  00002150  2**2
                  CONTENTS, READONLY, DEBUGGING
 10 .debug_str    000004fa  00000000  00000000  00002240  2**0
                  CONTENTS, READONLY, DEBUGGING
 11 .debug_loc    0000047a  00000000  00000000  0000273a  2**0
                  CONTENTS, READONLY, DEBUGGING
 12 .debug_ranges 00000018  00000000  00000000  00002bb4  2**0
                  CONTENTS, READONLY, DEBUGGING

Disassembly of section .text:

0000f800 <__vectors>:
    f800:	3d c0       	rjmp	.+122    	; 0xf87c <__ctors_end>
    f802:	00 00       	nop
    f804:	56 c0       	rjmp	.+172    	; 0xf8b2 <__bad_interrupt>
    f806:	00 00       	nop
    f808:	54 c0       	rjmp	.+168    	; 0xf8b2 <__bad_interrupt>
    f80a:	00 00       	nop
    f80c:	52 c0       	rjmp	.+164    	; 0xf8b2 <__bad_interrupt>
    f80e:	00 00       	nop
    f810:	50 c0       	rjmp	.+160    	; 0xf8b2 <__bad_interrupt>
    f812:	00 00       	nop
    f814:	4e c0       	rjmp	.+156    	; 0xf8b2 <__bad_interrupt>
    f816:	00 00       	nop
    f818:	4c c0       	rjmp	.+152    	; 0xf8b2 <__bad_interrupt>
    f81a:	00 00       	nop
    f81c:	4a c0       	rjmp	.+148    	; 0xf8b2 <__bad_interrupt>
    f81e:	00 00       	nop
    f820:	48 c0       	rjmp	.+144    	; 0xf8b2 <__bad_interrupt>
    f822:	00 00       	nop
    f824:	46 c0       	rjmp	.+140    	; 0xf8b2 <__bad_interrupt>
    f826:	00 00       	nop
    f828:	44 c0       	rjmp	.+136    	; 0xf8b2 <__bad_interrupt>
    f82a:	00 00       	nop
    f82c:	42 c0       	rjmp	.+132    	; 0xf8b2 <__bad_interrupt>
    f82e:	00 00       	nop
    f830:	40 c0       	rjmp	.+128    	; 0xf8b2 <__bad_interrupt>
    f832:	00 00       	nop
    f834:	3e c0       	rjmp	.+124    	; 0xf8b2 <__bad_interrupt>
    f836:	00 00       	nop
    f838:	3c c0       	rjmp	.+120    	; 0xf8b2 <__bad_interrupt>
    f83a:	00 00       	nop
    f83c:	3a c0       	rjmp	.+116    	; 0xf8b2 <__bad_interrupt>
    f83e:	00 00       	nop
    f840:	38 c0       	rjmp	.+112    	; 0xf8b2 <__bad_interrupt>
    f842:	00 00       	nop
    f844:	36 c0       	rjmp	.+108    	; 0xf8b2 <__bad_interrupt>
    f846:	00 00       	nop
    f848:	34 c0       	rjmp	.+104    	; 0xf8b2 <__bad_interrupt>
    f84a:	00 00       	nop
    f84c:	32 c0       	rjmp	.+100    	; 0xf8b2 <__bad_interrupt>
    f84e:	00 00       	nop
    f850:	30 c0       	rjmp	.+96     	; 0xf8b2 <__bad_interrupt>
    f852:	00 00       	nop
    f854:	2e c0       	rjmp	.+92     	; 0xf8b2 <__bad_interrupt>
    f856:	00 00       	nop
    f858:	2c c0       	rjmp	.+88     	; 0xf8b2 <__bad_interrupt>
    f85a:	00 00       	nop
    f85c:	2a c0       	rjmp	.+84     	; 0xf8b2 <__bad_interrupt>
    f85e:	00 00       	nop
    f860:	28 c0       	rjmp	.+80     	; 0xf8b2 <__bad_interrupt>
    f862:	00 00       	nop
    f864:	26 c0       	rjmp	.+76     	; 0xf8b2 <__bad_interrupt>
    f866:	00 00       	nop
    f868:	24 c0       	rjmp	.+72     	; 0xf8b2 <__bad_interrupt>
    f86a:	00 00       	nop
    f86c:	22 c0       	rjmp	.+68     	; 0xf8b2 <__bad_interrupt>
    f86e:	00 00       	nop
    f870:	20 c0       	rjmp	.+64     	; 0xf8b2 <__bad_interrupt>
    f872:	00 00       	nop
    f874:	1e c0       	rjmp	.+60     	; 0xf8b2 <__bad_interrupt>
    f876:	00 00       	nop
    f878:	1c c0       	rjmp	.+56     	; 0xf8b2 <__bad_interrupt>
	...

0000f87c <__ctors_end>:
    f87c:	11 24       	eor	r1, r1
    f87e:	1f be       	out	0x3f, r1	; 63
    f880:	cf ef       	ldi	r28, 0xFF	; 255
    f882:	d0 e1       	ldi	r29, 0x10	; 16
    f884:	de bf       	out	0x3e, r29	; 62
    f886:	cd bf       	out	0x3d, r28	; 61

0000f888 <__do_copy_data>:
    f888:	11 e0       	ldi	r17, 0x01	; 1
    f88a:	a0 e0       	ldi	r26, 0x00	; 0
    f88c:	b1 e0       	ldi	r27, 0x01	; 1
    f88e:	ea ea       	ldi	r30, 0xAA	; 170
    f890:	fd ef       	ldi	r31, 0xFD	; 253
    f892:	02 c0       	rjmp	.+4      	; 0xf898 <__do_copy_data+0x10>
    f894:	05 90       	lpm	r0, Z+
    f896:	0d 92       	st	X+, r0
    f898:	a2 30       	cpi	r26, 0x02	; 2
    f89a:	b1 07       	cpc	r27, r17
    f89c:	d9 f7       	brne	.-10     	; 0xf894 <__do_copy_data+0xc>

0000f89e <__do_clear_bss>:
    f89e:	22 e0       	ldi	r18, 0x02	; 2
    f8a0:	a2 e0       	ldi	r26, 0x02	; 2
    f8a2:	b1 e0       	ldi	r27, 0x01	; 1
    f8a4:	01 c0       	rjmp	.+2      	; 0xf8a8 <.do_clear_bss_start>

0000f8a6 <.do_clear_bss_loop>:
    f8a6:	1d 92       	st	X+, r1

0000f8a8 <.do_clear_bss_start>:
    f8a8:	ad 30       	cpi	r26, 0x0D	; 13
    f8aa:	b2 07       	cpc	r27, r18
    f8ac:	e1 f7       	brne	.-8      	; 0xf8a6 <.do_clear_bss_loop>
    f8ae:	ab d0       	rcall	.+342    	; 0xfa06 <main>
    f8b0:	7a c2       	rjmp	.+1268   	; 0xfda6 <_exit>

0000f8b2 <__bad_interrupt>:
    f8b2:	a6 cf       	rjmp	.-180    	; 0xf800 <__vectors>

0000f8b4 <putch>:
	}
#elif defined(__AVR_ATmega168__) || defined(__AVR_ATmega328P__) || defined (__AVR_ATmega328__)
	while (!(UCSR0A & _BV(UDRE0)));
	UDR0 = ch;
#elif defined(__AVR_ATmega644P__)
	while (!(UCSR0A & _BV(UDRE0)));
    f8b4:	90 91 c0 00 	lds	r25, 0x00C0	; 0x8000c0 <__data_load_end+0x7f0314>
    f8b8:	95 ff       	sbrs	r25, 5
    f8ba:	fc cf       	rjmp	.-8      	; 0xf8b4 <putch>
	UDR0 = ch;
    f8bc:	80 93 c6 00 	sts	0x00C6, r24	; 0x8000c6 <__data_load_end+0x7f031a>
    f8c0:	08 95       	ret

0000f8c2 <puthex>:
char gethex(void) {
	return (gethexnib() << 4) + gethexnib();
}


void puthex(char ch) {
    f8c2:	cf 93       	push	r28
    f8c4:	98 2f       	mov	r25, r24
	char ah;

	ah = ch >> 4;
    f8c6:	85 95       	asr	r24
    f8c8:	85 95       	asr	r24
    f8ca:	85 95       	asr	r24
    f8cc:	85 95       	asr	r24
	if(ah >= 0x0a) {
		ah = ah - 0x0a + 'a';
	} else {
		ah += '0';
    f8ce:	80 5d       	subi	r24, 0xD0	; 208
	}
	
	ch &= 0x0f;
    f8d0:	9f 70       	andi	r25, 0x0F	; 15
	if(ch >= 0x0a) {
    f8d2:	9a 30       	cpi	r25, 0x0A	; 10
    f8d4:	14 f0       	brlt	.+4      	; 0xf8da <puthex+0x18>
		ch = ch - 0x0a + 'a';
    f8d6:	c7 e5       	ldi	r28, 0x57	; 87
    f8d8:	01 c0       	rjmp	.+2      	; 0xf8dc <puthex+0x1a>
	} else {
		ch += '0';
    f8da:	c0 e3       	ldi	r28, 0x30	; 48
    f8dc:	c9 0f       	add	r28, r25
	}
	
	putch(ah);
    f8de:	ea df       	rcall	.-44     	; 0xf8b4 <putch>
    f8e0:	8c 2f       	mov	r24, r28
	putch(ch);
    f8e2:	cf 91       	pop	r28
}
    f8e4:	e7 cf       	rjmp	.-50     	; 0xf8b4 <putch>

0000f8e6 <getch>:
	} else {
		ch += '0';
	}
	
	putch(ah);
	putch(ch);
    f8e6:	cf 92       	push	r12
    f8e8:	df 92       	push	r13
#endif
}


char getch(void)
{
    f8ea:	ef 92       	push	r14
    f8ec:	ff 92       	push	r15
    f8ee:	c1 2c       	mov	r12, r1
    f8f0:	d1 2c       	mov	r13, r1

