night-ghost/MightyCore/avr/bootloaders/atmega/ATmegaBOOT_168_atmega644.hex.S
		return UDR1;
	}
	return 0;
#elif defined(__AVR_ATmega168__)  || defined(__AVR_ATmega328P__) || defined (__AVR_ATmega328__) || defined(__AVR_ATmega644P__)
	uint32_t count = 0;
    f8f2:	76 01       	movw	r14, r12
    f8f4:	80 91 c0 00 	lds	r24, 0x00C0	; 0x8000c0 <__data_load_end+0x7f0314>
	while(!(UCSR0A & _BV(RXC0))){
    f8f8:	87 fd       	sbrc	r24, 7
    f8fa:	13 c0       	rjmp	.+38     	; 0xf922 <getch+0x3c>
    f8fc:	8f ef       	ldi	r24, 0xFF	; 255
    f8fe:	c8 1a       	sub	r12, r24
		/* 20060803 DojoCorp:: Addon coming from the previous Bootloader*/               
		/* HACKME:: here is a good place to count times*/
		count++;
    f900:	d8 0a       	sbc	r13, r24
    f902:	e8 0a       	sbc	r14, r24
    f904:	f8 0a       	sbc	r15, r24
    f906:	81 e4       	ldi	r24, 0x41	; 65
    f908:	c8 16       	cp	r12, r24
		if (count > MAX_TIME_COUNT)
    f90a:	82 e4       	ldi	r24, 0x42	; 66
    f90c:	d8 06       	cpc	r13, r24
    f90e:	8f e0       	ldi	r24, 0x0F	; 15
    f910:	e8 06       	cpc	r14, r24
    f912:	f1 04       	cpc	r15, r1
    f914:	78 f3       	brcs	.-34     	; 0xf8f4 <getch+0xe>
    f916:	e0 91 02 01 	lds	r30, 0x0102	; 0x800102 <__data_end>
			app_start();
    f91a:	f0 91 03 01 	lds	r31, 0x0103	; 0x800103 <__data_end+0x1>
    f91e:	09 95       	icall
    f920:	e9 cf       	rjmp	.-46     	; 0xf8f4 <getch+0xe>
    f922:	80 91 c6 00 	lds	r24, 0x00C6	; 0x8000c6 <__data_load_end+0x7f031a>
	}
	return UDR0;
    f926:	ff 90       	pop	r15
    f928:	ef 90       	pop	r14
		if (count > MAX_TIME_COUNT)
			app_start();
	}
	return UDR;
#endif
}
    f92a:	df 90       	pop	r13
    f92c:	cf 90       	pop	r12
    f92e:	08 95       	ret

0000f930 <gethexnib>:
    f930:	cf 93       	push	r28
    f932:	d9 df       	rcall	.-78     	; 0xf8e6 <getch>
	} /* end of forever loop */

}


char gethexnib(void) {
    f934:	c8 2f       	mov	r28, r24
	char a;
	a = getch(); putch(a);
    f936:	be df       	rcall	.-132    	; 0xf8b4 <putch>
    f938:	c1 36       	cpi	r28, 0x61	; 97
    f93a:	14 f0       	brlt	.+4      	; 0xf940 <gethexnib+0x10>
    f93c:	89 ea       	ldi	r24, 0xA9	; 169
    f93e:	03 c0       	rjmp	.+6      	; 0xf946 <gethexnib+0x16>
	if(a >= 'a') {
    f940:	c0 33       	cpi	r28, 0x30	; 48
    f942:	1c f0       	brlt	.+6      	; 0xf94a <gethexnib+0x1a>
		return (a - 'a' + 0x0a);
    f944:	80 ed       	ldi	r24, 0xD0	; 208
    f946:	8c 0f       	add	r24, r28
	} else if(a >= '0') {
    f948:	01 c0       	rjmp	.+2      	; 0xf94c <gethexnib+0x1c>
    f94a:	8c 2f       	mov	r24, r28
		return(a - '0');
    f94c:	cf 91       	pop	r28
    f94e:	08 95       	ret

0000f950 <gethex>:
    f950:	cf 93       	push	r28
    f952:	ee df       	rcall	.-36     	; 0xf930 <gethexnib>
	}
	return a;
}
    f954:	c8 2f       	mov	r28, r24
    f956:	ec df       	rcall	.-40     	; 0xf930 <gethexnib>


char gethex(void) {
    f958:	90 e1       	ldi	r25, 0x10	; 16
	return (gethexnib() << 4) + gethexnib();
    f95a:	c9 9f       	mul	r28, r25
    f95c:	80 0d       	add	r24, r0
    f95e:	11 24       	eor	r1, r1
    f960:	cf 91       	pop	r28
    f962:	08 95       	ret

0000f964 <getNch>:
}
    f964:	cf 93       	push	r28
    f966:	c8 2f       	mov	r28, r24
    f968:	cc 23       	and	r28, r28
    f96a:	19 f0       	breq	.+6      	; 0xf972 <getNch+0xe>
    f96c:	bc df       	rcall	.-136    	; 0xf8e6 <getch>
    f96e:	c1 50       	subi	r28, 0x01	; 1
#endif
}


void getNch(uint8_t count)
{
    f970:	fb cf       	rjmp	.-10     	; 0xf968 <getNch+0x4>
    f972:	cf 91       	pop	r28
	while(count--) {
    f974:	08 95       	ret

0000f976 <byte_response>:
    f976:	cf 93       	push	r28
		else if(bootuart == 2) {
			while(!(UCSR1A & _BV(RXC1)));
			UDR1;
		}
#elif defined(__AVR_ATmega168__)  || defined(__AVR_ATmega328P__) || defined (__AVR_ATmega328__) || defined(__AVR_ATmega644P__)
		getch();
    f978:	c8 2f       	mov	r28, r24
    f97a:	b5 df       	rcall	.-150    	; 0xf8e6 <getch>
    f97c:	80 32       	cpi	r24, 0x20	; 32
    f97e:	39 f4       	brne	.+14     	; 0xf98e <byte_response+0x18>
		//while(!(UCSRA & _BV(RXC)));
		//UDR;
		getch(); // need to handle time out
#endif		
	}
}
    f980:	84 e1       	ldi	r24, 0x14	; 20
    f982:	98 df       	rcall	.-208    	; 0xf8b4 <putch>


void byte_response(uint8_t val)
{
    f984:	8c 2f       	mov	r24, r28
    f986:	96 df       	rcall	.-212    	; 0xf8b4 <putch>
	if (getch() == ' ') {
    f988:	80 e1       	ldi	r24, 0x10	; 16
    f98a:	cf 91       	pop	r28
    f98c:	93 cf       	rjmp	.-218    	; 0xf8b4 <putch>
    f98e:	80 91 04 01 	lds	r24, 0x0104	; 0x800104 <error_count>
		putch(0x14);
    f992:	8f 5f       	subi	r24, 0xFF	; 255
    f994:	80 93 04 01 	sts	0x0104, r24	; 0x800104 <error_count>
		putch(val);
    f998:	85 30       	cpi	r24, 0x05	; 5
    f99a:	31 f4       	brne	.+12     	; 0xf9a8 <byte_response+0x32>
		putch(0x10);
    f99c:	e0 91 02 01 	lds	r30, 0x0102	; 0x800102 <__data_end>
    f9a0:	f0 91 03 01 	lds	r31, 0x0103	; 0x800103 <__data_end+0x1>
	} else {
		if (++error_count == MAX_ERROR_COUNT)
    f9a4:	cf 91       	pop	r28
    f9a6:	09 94       	ijmp
    f9a8:	cf 91       	pop	r28
    f9aa:	08 95       	ret

0000f9ac <nothing_response>:
    f9ac:	9c df       	rcall	.-200    	; 0xf8e6 <getch>
    f9ae:	80 32       	cpi	r24, 0x20	; 32
    f9b0:	21 f4       	brne	.+8      	; 0xf9ba <nothing_response+0xe>
			app_start();
    f9b2:	84 e1       	ldi	r24, 0x14	; 20
    f9b4:	7f df       	rcall	.-258    	; 0xf8b4 <putch>
    f9b6:	80 e1       	ldi	r24, 0x10	; 16
    f9b8:	7d cf       	rjmp	.-262    	; 0xf8b4 <putch>
	}
}
    f9ba:	80 91 04 01 	lds	r24, 0x0104	; 0x800104 <error_count>
    f9be:	8f 5f       	subi	r24, 0xFF	; 255
    f9c0:	80 93 04 01 	sts	0x0104, r24	; 0x800104 <error_count>


void nothing_response(void)
{
	if (getch() == ' ') {
    f9c4:	85 30       	cpi	r24, 0x05	; 5
    f9c6:	29 f4       	brne	.+10     	; 0xf9d2 <nothing_response+0x26>
    f9c8:	e0 91 02 01 	lds	r30, 0x0102	; 0x800102 <__data_end>
		putch(0x14);
    f9cc:	f0 91 03 01 	lds	r31, 0x0103	; 0x800103 <__data_end+0x1>
		putch(0x10);
    f9d0:	09 94       	ijmp
    f9d2:	08 95       	ret

