night-ghost/MightyCore/avr/bootloaders/atmega/ATmegaBOOT_168_atmega644.hex.S
0000f9d4 <flash_led>:
    f9d4:	88 23       	and	r24, r24
	} else {
		if (++error_count == MAX_ERROR_COUNT)
    f9d6:	b1 f0       	breq	.+44     	; 0xfa04 <flash_led+0x30>
    f9d8:	13 9a       	sbi	0x02, 3	; 2
    f9da:	2f ef       	ldi	r18, 0xFF	; 255
    f9dc:	31 ee       	ldi	r19, 0xE1	; 225
    f9de:	94 e0       	ldi	r25, 0x04	; 4
    f9e0:	21 50       	subi	r18, 0x01	; 1
    f9e2:	30 40       	sbci	r19, 0x00	; 0
			app_start();
    f9e4:	90 40       	sbci	r25, 0x00	; 0
    f9e6:	e1 f7       	brne	.-8      	; 0xf9e0 <flash_led+0xc>
    f9e8:	00 c0       	rjmp	.+0      	; 0xf9ea <flash_led+0x16>
    f9ea:	00 00       	nop
    f9ec:	13 98       	cbi	0x02, 3	; 2
    f9ee:	2f ef       	ldi	r18, 0xFF	; 255
	}
}

void flash_led(uint8_t count)
{
	while (count--) {
    f9f0:	31 ee       	ldi	r19, 0xE1	; 225
    f9f2:	94 e0       	ldi	r25, 0x04	; 4
		LED_PORT |= _BV(LED);
    f9f4:	21 50       	subi	r18, 0x01	; 1
	#else
		//round up by default
		__ticks_dc = (uint32_t)(ceil(fabs(__tmp)));
	#endif

	__builtin_avr_delay_cycles(__ticks_dc);
    f9f6:	30 40       	sbci	r19, 0x00	; 0
    f9f8:	90 40       	sbci	r25, 0x00	; 0
    f9fa:	e1 f7       	brne	.-8      	; 0xf9f4 <flash_led+0x20>
    f9fc:	00 c0       	rjmp	.+0      	; 0xf9fe <flash_led+0x2a>
    f9fe:	00 00       	nop
    fa00:	81 50       	subi	r24, 0x01	; 1
    fa02:	e8 cf       	rjmp	.-48     	; 0xf9d4 <flash_led>
    fa04:	08 95       	ret

0000fa06 <main>:
    fa06:	94 b7       	in	r25, 0x34	; 52
		_delay_ms(100);
		LED_PORT &= ~_BV(LED);
    fa08:	14 be       	out	0x34, r1	; 52
    fa0a:	80 91 60 00 	lds	r24, 0x0060	; 0x800060 <__data_load_end+0x7f02b4>
    fa0e:	88 61       	ori	r24, 0x18	; 24
    fa10:	80 93 60 00 	sts	0x0060, r24	; 0x800060 <__data_load_end+0x7f02b4>
    fa14:	10 92 60 00 	sts	0x0060, r1	; 0x800060 <__data_load_end+0x7f02b4>
    fa18:	91 fd       	sbrc	r25, 1
    fa1a:	05 c0       	rjmp	.+10     	; 0xfa26 <main+0x20>
    fa1c:	e0 91 02 01 	lds	r30, 0x0102	; 0x800102 <__data_end>
		_delay_ms(100);
	}
}
    fa20:	f0 91 03 01 	lds	r31, 0x0103	; 0x800103 <__data_end+0x1>
	WDTCSR |= _BV(WDCE) | _BV(WDE);
	WDTCSR = 0;

	// Check if the WDT was used to reset, in which case we dont bootload and skip straight to the code. woot.
	if (! (ch &  _BV(EXTRF))) // if its a not an external reset...
		app_start();  // skip bootloader
    fa24:	09 95       	icall
	/* however, we don't wanna confuse people, to avoid making a mess, we will stick to RXD0, TXD0 */
	bootuart = 1;
#endif

	/* check if flash is programmed already, if not start bootloader anyway */
	if(pgm_read_byte_near(0x0000) != 0xFF) {
    fa26:	e0 e0       	ldi	r30, 0x00	; 0
    fa28:	f0 e0       	ldi	r31, 0x00	; 0
    fa2a:	e4 91       	lpm	r30, Z
		UCSR1A = 0x00;
		UCSR1C = 0x06;
		UCSR1B = _BV(TXEN1)|_BV(RXEN1);
	}
#elif defined (__AVR_ATmega644P__)
		UBRR0L = (uint8_t)(F_CPU/(BAUD_RATE*16L)-1);
    fa2c:	80 e1       	ldi	r24, 0x10	; 16
    fa2e:	80 93 c4 00 	sts	0x00C4, r24	; 0x8000c4 <__data_load_end+0x7f0318>
		UBRR0H = (F_CPU/(BAUD_RATE*16L)-1) >> 8;
    fa32:	10 92 c5 00 	sts	0x00C5, r1	; 0x8000c5 <__data_load_end+0x7f0319>
		UCSR0A = 0x00;
    fa36:	10 92 c0 00 	sts	0x00C0, r1	; 0x8000c0 <__data_load_end+0x7f0314>
		UCSR0C = 0x06;
    fa3a:	86 e0       	ldi	r24, 0x06	; 6
    fa3c:	80 93 c2 00 	sts	0x00C2, r24	; 0x8000c2 <__data_load_end+0x7f0316>
		UCSR0B = _BV(TXEN0)|_BV(RXEN0);
    fa40:	88 e1       	ldi	r24, 0x18	; 24
    fa42:	80 93 c1 00 	sts	0x00C1, r24	; 0x8000c1 <__data_load_end+0x7f0315>

	/* Enable internal pull-up resistor on pin D0 (RX), in order
	to supress line noise that prevents the bootloader from
	timing out */
	DDRD &= ~_BV(PIND0);
    fa46:	50 98       	cbi	0x0a, 0	; 10
	PORTD |= _BV(PIND0);
    fa48:	58 9a       	sbi	0x0b, 0	; 11
	PORTE |= _BV(PINE0);
#endif


	/* set LED pin as output */
	LED_DDR |= _BV(LED);
    fa4a:	0b 9a       	sbi	0x01, 3	; 1
	/* flash onboard LED to signal entering of bootloader */
#if defined(__AVR_ATmega128__) || defined(__AVR_ATmega1280__)
	// 4x for UART0, 5x for UART1
	flash_led(NUM_LED_FLASHES + bootuart);
#else
	flash_led(NUM_LED_FLASHES);
    fa4c:	81 e0       	ldi	r24, 0x01	; 1
    fa4e:	c2 df       	rcall	.-124    	; 0xf9d4 <flash_led>
    fa50:	ff 24       	eor	r15, r15
#endif
					address.word++;
				}			
			}
			else {					        //Write to FLASH one page at a time
				if (address.byte[1]>127) address_high = 0x01;	//Only possible with m128, m256 will need 3rd address byte. FIXME
    fa52:	f3 94       	inc	r15
    fa54:	48 df       	rcall	.-368    	; 0xf8e6 <getch>

	/* forever loop */
	for (;;) {

	/* get character from UART */
	ch = getch();
    fa56:	80 33       	cpi	r24, 0x30	; 48
    fa58:	09 f4       	brne	.+2      	; 0xfa5c <main+0x56>

	/* A bunch of if...else if... gives smaller code than switch...case ! */

	/* Hello is anyone home ? */ 
	if(ch=='0') {
    fa5a:	36 c0       	rjmp	.+108    	; 0xfac8 <main+0xc2>
    fa5c:	81 33       	cpi	r24, 0x31	; 49
    fa5e:	a1 f4       	brne	.+40     	; 0xfa88 <main+0x82>


	/* Request programmer ID */
	/* Not using PROGMEM string due to boot block in m128 being beyond 64kB boundry  */
	/* Would need to selectively manipulate RAMPZ, and it's only 9 characters anyway so who cares.  */
	else if(ch=='1') {
    fa60:	42 df       	rcall	.-380    	; 0xf8e6 <getch>
    fa62:	80 32       	cpi	r24, 0x20	; 32
		if (getch() == ' ') {
    fa64:	09 f0       	breq	.+2      	; 0xfa68 <main+0x62>
    fa66:	7b c1       	rjmp	.+758    	; 0xfd5e <block_done+0xba>
    fa68:	84 e1       	ldi	r24, 0x14	; 20
    fa6a:	24 df       	rcall	.-440    	; 0xf8b4 <putch>
    fa6c:	81 e4       	ldi	r24, 0x41	; 65
			putch(0x14);
    fa6e:	22 df       	rcall	.-444    	; 0xf8b4 <putch>
    fa70:	86 e5       	ldi	r24, 0x56	; 86
    fa72:	20 df       	rcall	.-448    	; 0xf8b4 <putch>
			putch('A');
    fa74:	82 e5       	ldi	r24, 0x52	; 82
    fa76:	1e df       	rcall	.-452    	; 0xf8b4 <putch>
    fa78:	80 e2       	ldi	r24, 0x20	; 32
			putch('V');
    fa7a:	1c df       	rcall	.-456    	; 0xf8b4 <putch>
    fa7c:	89 e4       	ldi	r24, 0x49	; 73
    fa7e:	1a df       	rcall	.-460    	; 0xf8b4 <putch>
			putch('R');
    fa80:	83 e5       	ldi	r24, 0x53	; 83
    fa82:	18 df       	rcall	.-464    	; 0xf8b4 <putch>
    fa84:	80 e5       	ldi	r24, 0x50	; 80
			putch(' ');
    fa86:	64 c1       	rjmp	.+712    	; 0xfd50 <block_done+0xac>
    fa88:	80 34       	cpi	r24, 0x40	; 64
    fa8a:	29 f4       	brne	.+10     	; 0xfa96 <main+0x90>
			putch('I');
    fa8c:	2c df       	rcall	.-424    	; 0xf8e6 <getch>
    fa8e:	86 38       	cpi	r24, 0x86	; 134
    fa90:	d8 f0       	brcs	.+54     	; 0xfac8 <main+0xc2>
			putch('S');
    fa92:	29 df       	rcall	.-430    	; 0xf8e6 <getch>
    fa94:	19 c0       	rjmp	.+50     	; 0xfac8 <main+0xc2>
    fa96:	81 34       	cpi	r24, 0x41	; 65
			putch('P');
    fa98:	99 f4       	brne	.+38     	; 0xfac0 <main+0xba>
    fa9a:	25 df       	rcall	.-438    	; 0xf8e6 <getch>
		}
	}


	/* AVR ISP/STK500 board commands  DON'T CARE so default nothing_response */
	else if(ch=='@') {
    fa9c:	80 38       	cpi	r24, 0x80	; 128
    fa9e:	11 f4       	brne	.+4      	; 0xfaa4 <main+0x9e>
		ch2 = getch();
    faa0:	82 e0       	ldi	r24, 0x02	; 2
    faa2:	03 c0       	rjmp	.+6      	; 0xfaaa <main+0xa4>
		if (ch2>0x85) getch();
    faa4:	81 38       	cpi	r24, 0x81	; 129
    faa6:	19 f4       	brne	.+6      	; 0xfaae <main+0xa8>
    faa8:	81 e0       	ldi	r24, 0x01	; 1
    faaa:	65 df       	rcall	.-310    	; 0xf976 <byte_response>
    faac:	d3 cf       	rjmp	.-90     	; 0xfa54 <main+0x4e>
		nothing_response();
	}


	/* AVR ISP/STK500 board requests */
	else if(ch=='A') {
    faae:	82 38       	cpi	r24, 0x82	; 130
    fab0:	11 f4       	brne	.+4      	; 0xfab6 <main+0xb0>
		ch2 = getch();
    fab2:	80 e1       	ldi	r24, 0x10	; 16
    fab4:	fa cf       	rjmp	.-12     	; 0xfaaa <main+0xa4>
		if(ch2==0x80) byte_response(HW_VER);		// Hardware version
    fab6:	88 39       	cpi	r24, 0x98	; 152
    fab8:	09 f0       	breq	.+2      	; 0xfabc <main+0xb6>
    faba:	35 c0       	rjmp	.+106    	; 0xfb26 <main+0x120>
    fabc:	83 e0       	ldi	r24, 0x03	; 3
		else if(ch2==0x81) byte_response(SW_MAJOR);	// Software major version
    fabe:	f5 cf       	rjmp	.-22     	; 0xfaaa <main+0xa4>
    fac0:	82 34       	cpi	r24, 0x42	; 66
    fac2:	21 f4       	brne	.+8      	; 0xfacc <main+0xc6>
    fac4:	84 e1       	ldi	r24, 0x14	; 20
    fac6:	4e df       	rcall	.-356    	; 0xf964 <getNch>
    fac8:	71 df       	rcall	.-286    	; 0xf9ac <nothing_response>
		else if(ch2==0x82) byte_response(SW_MINOR);	// Software minor version
    faca:	c4 cf       	rjmp	.-120    	; 0xfa54 <main+0x4e>
    facc:	85 34       	cpi	r24, 0x45	; 69
    face:	11 f4       	brne	.+4      	; 0xfad4 <main+0xce>
    fad0:	85 e0       	ldi	r24, 0x05	; 5
		else if(ch2==0x98) byte_response(0x03);		// Unknown but seems to be required by avr studio 3.56
    fad2:	f9 cf       	rjmp	.-14     	; 0xfac6 <main+0xc0>
    fad4:	98 2f       	mov	r25, r24
    fad6:	9d 7f       	andi	r25, 0xFD	; 253
    fad8:	90 35       	cpi	r25, 0x50	; 80
    fada:	b1 f3       	breq	.-20     	; 0xfac8 <main+0xc2>
		else byte_response(0x00);				// Covers various unnecessary responses we don't care about
	}


	/* Device Parameters  DON'T CARE, DEVICE IS FIXED  */
	else if(ch=='B') {
    fadc:	81 35       	cpi	r24, 0x51	; 81
    fade:	29 f4       	brne	.+10     	; 0xfaea <main+0xe4>
		getNch(20);
    fae0:	65 df       	rcall	.-310    	; 0xf9ac <nothing_response>
    fae2:	88 e0       	ldi	r24, 0x08	; 8
    fae4:	80 93 60 00 	sts	0x0060, r24	; 0x800060 <__data_load_end+0x7f02b4>
		nothing_response();
    fae8:	ff cf       	rjmp	.-2      	; 0xfae8 <main+0xe2>
    faea:	85 35       	cpi	r24, 0x55	; 85
	}


	/* Parallel programming stuff  DON'T CARE  */
	else if(ch=='E') {
    faec:	39 f4       	brne	.+14     	; 0xfafc <main+0xf6>
    faee:	fb de       	rcall	.-522    	; 0xf8e6 <getch>
		getNch(5);
    faf0:	80 93 06 01 	sts	0x0106, r24	; 0x800106 <address>
	}


	/* P: Enter programming mode  */
	/* R: Erase device, don't care as we will erase one page at a time anyway.  */
	else if(ch=='P' || ch=='R') {
    faf4:	f8 de       	rcall	.-528    	; 0xf8e6 <getch>
    faf6:	80 93 07 01 	sts	0x0107, r24	; 0x800107 <address+0x1>
    fafa:	e6 cf       	rjmp	.-52     	; 0xfac8 <main+0xc2>
		nothing_response();
	}


	/* Leave programming mode  */
	else if(ch=='Q') {
    fafc:	86 35       	cpi	r24, 0x56	; 86
    fafe:	a9 f4       	brne	.+42     	; 0xfb2a <main+0x124>
		nothing_response();
    fb00:	f2 de       	rcall	.-540    	; 0xf8e6 <getch>
    fb02:	80 33       	cpi	r24, 0x30	; 48
#ifdef WATCHDOG_MODS
		// autoreset via watchdog (sneaky!)
		WDTCSR = _BV(WDE);
    fb04:	71 f4       	brne	.+28     	; 0xfb22 <main+0x11c>
    fb06:	ef de       	rcall	.-546    	; 0xf8e6 <getch>
    fb08:	ee de       	rcall	.-548    	; 0xf8e6 <getch>
		while (1); // 16 ms
    fb0a:	18 2f       	mov	r17, r24


	/* Set address, little endian. EEPROM in bytes, FLASH in words  */
	/* Perhaps extra address bytes may be added in future to support > 128kB FLASH.  */
	/* This might explain why little endian was used here, big endian used everywhere else.  */
	else if(ch=='U') {
    fb0c:	ec de       	rcall	.-552    	; 0xf8e6 <getch>
    fb0e:	11 11       	cpse	r17, r1
		address.byte[0] = getch();
    fb10:	02 c0       	rjmp	.+4      	; 0xfb16 <main+0x110>
    fb12:	8e e1       	ldi	r24, 0x1E	; 30
    fb14:	ca cf       	rjmp	.-108    	; 0xfaaa <main+0xa4>
    fb16:	11 30       	cpi	r17, 0x01	; 1
		address.byte[1] = getch();
    fb18:	11 f4       	brne	.+4      	; 0xfb1e <main+0x118>
    fb1a:	86 e9       	ldi	r24, 0x96	; 150
    fb1c:	c6 cf       	rjmp	.-116    	; 0xfaaa <main+0xa4>
    fb1e:	8a e0       	ldi	r24, 0x0A	; 10
    fb20:	c4 cf       	rjmp	.-120    	; 0xfaaa <main+0xa4>
		nothing_response();
	}


	/* Universal SPI programming command, disabled.  Would be used for fuses and lock bits.  */
	else if(ch=='V') {
    fb22:	83 e0       	ldi	r24, 0x03	; 3
    fb24:	1f df       	rcall	.-450    	; 0xf964 <getNch>
		if (getch() == 0x30) {
    fb26:	80 e0       	ldi	r24, 0x00	; 0
    fb28:	c0 cf       	rjmp	.-128    	; 0xfaaa <main+0xa4>
    fb2a:	84 36       	cpi	r24, 0x64	; 100
    fb2c:	09 f0       	breq	.+2      	; 0xfb30 <main+0x12a>
			getch();
    fb2e:	bd c0       	rjmp	.+378    	; 0xfcaa <block_done+0x6>
    fb30:	da de       	rcall	.-588    	; 0xf8e6 <getch>
			ch = getch();
    fb32:	80 93 09 02 	sts	0x0209, r24	; 0x800209 <length+0x1>
    fb36:	d7 de       	rcall	.-594    	; 0xf8e6 <getch>
			getch();
    fb38:	80 93 08 02 	sts	0x0208, r24	; 0x800208 <length>
			if (ch == 0) {
    fb3c:	80 91 0c 02 	lds	r24, 0x020C	; 0x80020c <flags>
				byte_response(SIG1);
    fb40:	8e 7f       	andi	r24, 0xFE	; 254
    fb42:	80 93 0c 02 	sts	0x020C, r24	; 0x80020c <flags>
			} else if (ch == 1) {
    fb46:	cf de       	rcall	.-610    	; 0xf8e6 <getch>
				byte_response(SIG2); 
    fb48:	85 34       	cpi	r24, 0x45	; 69
    fb4a:	29 f4       	brne	.+10     	; 0xfb56 <main+0x150>
			} else {
				byte_response(SIG3);
    fb4c:	80 91 0c 02 	lds	r24, 0x020C	; 0x80020c <flags>
			} 
		} else {
			getNch(3);
    fb50:	81 60       	ori	r24, 0x01	; 1
    fb52:	80 93 0c 02 	sts	0x020C, r24	; 0x80020c <flags>
			byte_response(0x00);
    fb56:	08 e0       	ldi	r16, 0x08	; 8
    fb58:	11 e0       	ldi	r17, 0x01	; 1
		}
	}


	/* Write memory, length is big endian and is in bytes  */
	else if(ch=='d') {
    fb5a:	20 91 08 02 	lds	r18, 0x0208	; 0x800208 <length>
    fb5e:	30 91 09 02 	lds	r19, 0x0209	; 0x800209 <length+0x1>
		length.byte[1] = getch();
    fb62:	c8 01       	movw	r24, r16
    fb64:	88 50       	subi	r24, 0x08	; 8
    fb66:	91 40       	sbci	r25, 0x01	; 1
		length.byte[0] = getch();
    fb68:	82 17       	cp	r24, r18
    fb6a:	93 07       	cpc	r25, r19
    fb6c:	28 f4       	brcc	.+10     	; 0xfb78 <main+0x172>
    fb6e:	bb de       	rcall	.-650    	; 0xf8e6 <getch>
		flags.eeprom = 0;
    fb70:	f8 01       	movw	r30, r16
    fb72:	81 93       	st	Z+, r24
    fb74:	8f 01       	movw	r16, r30
    fb76:	f1 cf       	rjmp	.-30     	; 0xfb5a <main+0x154>
    fb78:	b6 de       	rcall	.-660    	; 0xf8e6 <getch>
		if (getch() == 'E') flags.eeprom = 1;
    fb7a:	80 32       	cpi	r24, 0x20	; 32
    fb7c:	09 f0       	breq	.+2      	; 0xfb80 <main+0x17a>
    fb7e:	ef c0       	rjmp	.+478    	; 0xfd5e <block_done+0xba>
    fb80:	80 91 0c 02 	lds	r24, 0x020C	; 0x80020c <flags>
    fb84:	20 91 06 01 	lds	r18, 0x0106	; 0x800106 <address>
    fb88:	30 91 07 01 	lds	r19, 0x0107	; 0x800107 <address+0x1>
void (*app_start)(void) = 0x0000;


/* main program starts here */
int main(void)
{
    fb8c:	80 ff       	sbrs	r24, 0
    fb8e:	25 c0       	rjmp	.+74     	; 0xfbda <main+0x1d4>
	else if(ch=='d') {
		length.byte[1] = getch();
		length.byte[0] = getch();
		flags.eeprom = 0;
		if (getch() == 'E') flags.eeprom = 1;
		for (w=0;w<length.word;w++) {
    fb90:	22 0f       	add	r18, r18
    fb92:	33 1f       	adc	r19, r19
    fb94:	30 93 07 01 	sts	0x0107, r19	; 0x800107 <address+0x1>
    fb98:	20 93 06 01 	sts	0x0106, r18	; 0x800106 <address>
    fb9c:	08 e0       	ldi	r16, 0x08	; 8
    fb9e:	11 e0       	ldi	r17, 0x01	; 1
    fba0:	20 91 08 02 	lds	r18, 0x0208	; 0x800208 <length>
			buff[w] = getch();	                        // Store data in buffer, can't keep up with serial data stream whilst programming pages
    fba4:	30 91 09 02 	lds	r19, 0x0209	; 0x800209 <length+0x1>
    fba8:	c8 01       	movw	r24, r16
    fbaa:	88 50       	subi	r24, 0x08	; 8
    fbac:	91 40       	sbci	r25, 0x01	; 1
    fbae:	82 17       	cp	r24, r18
		}
		if (getch() == ' ') {
    fbb0:	93 07       	cpc	r25, r19
    fbb2:	08 f0       	brcs	.+2      	; 0xfbb6 <main+0x1b0>
    fbb4:	78 c0       	rjmp	.+240    	; 0xfca6 <block_done+0x2>
    fbb6:	f8 01       	movw	r30, r16
    fbb8:	61 91       	ld	r22, Z+
			if (flags.eeprom) {		                //Write to EEPROM one byte at a time
    fbba:	8f 01       	movw	r16, r30
    fbbc:	80 91 06 01 	lds	r24, 0x0106	; 0x800106 <address>
    fbc0:	90 91 07 01 	lds	r25, 0x0107	; 0x800107 <address+0x1>
    fbc4:	e2 d0       	rcall	.+452    	; 0xfd8a <eeprom_write_byte>
    fbc6:	80 91 06 01 	lds	r24, 0x0106	; 0x800106 <address>
				address.word <<= 1;
    fbca:	90 91 07 01 	lds	r25, 0x0107	; 0x800107 <address+0x1>
    fbce:	01 96       	adiw	r24, 0x01	; 1
    fbd0:	90 93 07 01 	sts	0x0107, r25	; 0x800107 <address+0x1>
    fbd4:	80 93 06 01 	sts	0x0106, r24	; 0x800106 <address>
				for(w=0;w<length.word;w++) {
    fbd8:	e3 cf       	rjmp	.-58     	; 0xfba0 <main+0x19a>
    fbda:	80 91 07 01 	lds	r24, 0x0107	; 0x800107 <address+0x1>
    fbde:	88 0f       	add	r24, r24
    fbe0:	88 0b       	sbc	r24, r24
    fbe2:	8f 21       	and	r24, r15
    fbe4:	80 93 0b 02 	sts	0x020B, r24	; 0x80020b <address_high>
    fbe8:	22 0f       	add	r18, r18
    fbea:	33 1f       	adc	r19, r19
    fbec:	30 93 07 01 	sts	0x0107, r19	; 0x800107 <address+0x1>
					EEAR = (uint16_t)(void *)address.word;
					EEDR = buff[w];
					EECR |= (1<<EEMPE);
					EECR |= (1<<EEPE);
#else
					eeprom_write_byte((void *)address.word,buff[w]);
    fbf0:	20 93 06 01 	sts	0x0106, r18	; 0x800106 <address>
    fbf4:	80 91 08 02 	lds	r24, 0x0208	; 0x800208 <length>
    fbf8:	80 ff       	sbrs	r24, 0
    fbfa:	09 c0       	rjmp	.+18     	; 0xfc0e <main+0x208>
    fbfc:	80 91 08 02 	lds	r24, 0x0208	; 0x800208 <length>
    fc00:	90 91 09 02 	lds	r25, 0x0209	; 0x800209 <length+0x1>
#endif
					address.word++;
    fc04:	01 96       	adiw	r24, 0x01	; 1
    fc06:	90 93 09 02 	sts	0x0209, r25	; 0x800209 <length+0x1>
    fc0a:	80 93 08 02 	sts	0x0208, r24	; 0x800208 <length>
    fc0e:	f8 94       	cli
    fc10:	f9 99       	sbic	0x1f, 1	; 31
    fc12:	fe cf       	rjmp	.-4      	; 0xfc10 <main+0x20a>
    fc14:	11 27       	eor	r17, r17
				}			
			}
			else {					        //Write to FLASH one page at a time
				if (address.byte[1]>127) address_high = 0x01;	//Only possible with m128, m256 will need 3rd address byte. FIXME
    fc16:	e0 91 06 01 	lds	r30, 0x0106	; 0x800106 <address>
    fc1a:	f0 91 07 01 	lds	r31, 0x0107	; 0x800107 <address+0x1>
    fc1e:	c8 e0       	ldi	r28, 0x08	; 8
    fc20:	d1 e0       	ldi	r29, 0x01	; 1
    fc22:	80 91 08 02 	lds	r24, 0x0208	; 0x800208 <length>
				else address_high = 0x00;
#if defined(__AVR_ATmega128__) || defined(__AVR_ATmega1280__) || defined(__AVR_ATmega1281__)
				RAMPZ = address_high;
#endif
				address.word = address.word << 1;	        //address * 2 -> byte location
    fc26:	90 91 09 02 	lds	r25, 0x0209	; 0x800209 <length+0x1>

