night-ghost/MightyCore/avr/bootloaders/atmega/ATmegaBOOT_168_atmega644.hex.S
0000fc2a <length_loop>:
    fc2a:	10 30       	cpi	r17, 0x00	; 0
    fc2c:	91 f4       	brne	.+36     	; 0xfc52 <no_page_erase>

0000fc2e <wait_spm1>:
    fc2e:	00 91 57 00 	lds	r16, 0x0057	; 0x800057 <__data_load_end+0x7f02ab>
				/* if ((length.byte[0] & 0x01) == 0x01) length.word++;	//Even up an odd number of bytes */
				if ((length.byte[0] & 0x01)) length.word++;	//Even up an odd number of bytes
    fc32:	01 70       	andi	r16, 0x01	; 1
    fc34:	01 30       	cpi	r16, 0x01	; 1
    fc36:	d9 f3       	breq	.-10     	; 0xfc2e <wait_spm1>
    fc38:	03 e0       	ldi	r16, 0x03	; 3
    fc3a:	00 93 57 00 	sts	0x0057, r16	; 0x800057 <__data_load_end+0x7f02ab>
    fc3e:	e8 95       	spm

0000fc40 <wait_spm2>:
    fc40:	00 91 57 00 	lds	r16, 0x0057	; 0x800057 <__data_load_end+0x7f02ab>
    fc44:	01 70       	andi	r16, 0x01	; 1
    fc46:	01 30       	cpi	r16, 0x01	; 1
    fc48:	d9 f3       	breq	.-10     	; 0xfc40 <wait_spm2>
				cli();					//Disable interrupts, just to be sure
    fc4a:	01 e1       	ldi	r16, 0x11	; 17
#if defined(EEPE)
				while(bit_is_set(EECR,EEPE));			//Wait for previous EEPROM writes to complete
    fc4c:	00 93 57 00 	sts	0x0057, r16	; 0x800057 <__data_load_end+0x7f02ab>
#else
				while(bit_is_set(EECR,EEWE));			//Wait for previous EEPROM writes to complete
#endif
				asm volatile(
    fc50:	e8 95       	spm

0000fc52 <no_page_erase>:
    fc52:	09 90       	ld	r0, Y+
    fc54:	19 90       	ld	r1, Y+

0000fc56 <wait_spm3>:
    fc56:	00 91 57 00 	lds	r16, 0x0057	; 0x800057 <__data_load_end+0x7f02ab>
    fc5a:	01 70       	andi	r16, 0x01	; 1
    fc5c:	01 30       	cpi	r16, 0x01	; 1
    fc5e:	d9 f3       	breq	.-10     	; 0xfc56 <wait_spm3>
    fc60:	01 e0       	ldi	r16, 0x01	; 1
    fc62:	00 93 57 00 	sts	0x0057, r16	; 0x800057 <__data_load_end+0x7f02ab>
    fc66:	e8 95       	spm
    fc68:	13 95       	inc	r17
    fc6a:	10 34       	cpi	r17, 0x40	; 64
    fc6c:	98 f0       	brcs	.+38     	; 0xfc94 <same_page>

0000fc6e <write_page>:
    fc6e:	11 27       	eor	r17, r17

0000fc70 <wait_spm4>:
    fc70:	00 91 57 00 	lds	r16, 0x0057	; 0x800057 <__data_load_end+0x7f02ab>
    fc74:	01 70       	andi	r16, 0x01	; 1
    fc76:	01 30       	cpi	r16, 0x01	; 1
    fc78:	d9 f3       	breq	.-10     	; 0xfc70 <wait_spm4>
    fc7a:	05 e0       	ldi	r16, 0x05	; 5
    fc7c:	00 93 57 00 	sts	0x0057, r16	; 0x800057 <__data_load_end+0x7f02ab>
    fc80:	e8 95       	spm

0000fc82 <wait_spm5>:
    fc82:	00 91 57 00 	lds	r16, 0x0057	; 0x800057 <__data_load_end+0x7f02ab>
    fc86:	01 70       	andi	r16, 0x01	; 1
    fc88:	01 30       	cpi	r16, 0x01	; 1
    fc8a:	d9 f3       	breq	.-10     	; 0xfc82 <wait_spm5>
    fc8c:	01 e1       	ldi	r16, 0x11	; 17
    fc8e:	00 93 57 00 	sts	0x0057, r16	; 0x800057 <__data_load_end+0x7f02ab>
    fc92:	e8 95       	spm

0000fc94 <same_page>:
    fc94:	32 96       	adiw	r30, 0x02	; 2
    fc96:	02 97       	sbiw	r24, 0x02	; 2
    fc98:	09 f0       	breq	.+2      	; 0xfc9c <final_write>
    fc9a:	c7 cf       	rjmp	.-114    	; 0xfc2a <length_loop>

0000fc9c <final_write>:
    fc9c:	10 30       	cpi	r17, 0x00	; 0
    fc9e:	11 f0       	breq	.+4      	; 0xfca4 <block_done>
    fca0:	02 96       	adiw	r24, 0x02	; 2
    fca2:	e5 cf       	rjmp	.-54     	; 0xfc6e <write_page>

0000fca4 <block_done>:
    fca4:	11 24       	eor	r1, r1
    fca6:	84 e1       	ldi	r24, 0x14	; 20
    fca8:	53 c0       	rjmp	.+166    	; 0xfd50 <block_done+0xac>
    fcaa:	84 37       	cpi	r24, 0x74	; 116
    fcac:	09 f0       	breq	.+2      	; 0xfcb0 <block_done+0xc>
    fcae:	44 c0       	rjmp	.+136    	; 0xfd38 <block_done+0x94>
    fcb0:	1a de       	rcall	.-972    	; 0xf8e6 <getch>
    fcb2:	80 93 09 02 	sts	0x0209, r24	; 0x800209 <length+0x1>
    fcb6:	17 de       	rcall	.-978    	; 0xf8e6 <getch>
    fcb8:	80 93 08 02 	sts	0x0208, r24	; 0x800208 <length>
    fcbc:	80 91 06 01 	lds	r24, 0x0106	; 0x800106 <address>
    fcc0:	90 91 07 01 	lds	r25, 0x0107	; 0x800107 <address+0x1>
    fcc4:	88 0f       	add	r24, r24
    fcc6:	99 1f       	adc	r25, r25
    fcc8:	90 93 07 01 	sts	0x0107, r25	; 0x800107 <address+0x1>
    fccc:	80 93 06 01 	sts	0x0106, r24	; 0x800106 <address>
    fcd0:	0a de       	rcall	.-1004   	; 0xf8e6 <getch>
    fcd2:	90 91 0c 02 	lds	r25, 0x020C	; 0x80020c <flags>
    fcd6:	85 34       	cpi	r24, 0x45	; 69
    fcd8:	11 f4       	brne	.+4      	; 0xfcde <block_done+0x3a>
    fcda:	91 60       	ori	r25, 0x01	; 1
    fcdc:	01 c0       	rjmp	.+2      	; 0xfce0 <block_done+0x3c>
    fcde:	9e 7f       	andi	r25, 0xFE	; 254
    fce0:	90 93 0c 02 	sts	0x020C, r25	; 0x80020c <flags>
#endif
					 );
				/* Should really add a wait for RWW section to be enabled, don't actually need it since we never */
				/* exit the bootloader without a power cycle anyhow */
			}
			putch(0x14);
    fce4:	00 de       	rcall	.-1024   	; 0xf8e6 <getch>
		}		
	}


	/* Read memory block mode, length is big endian.  */
	else if(ch=='t') {
    fce6:	80 32       	cpi	r24, 0x20	; 32
    fce8:	09 f0       	breq	.+2      	; 0xfcec <block_done+0x48>
    fcea:	b4 ce       	rjmp	.-664    	; 0xfa54 <main+0x4e>
		length.byte[1] = getch();
    fcec:	84 e1       	ldi	r24, 0x14	; 20
    fcee:	e2 dd       	rcall	.-1084   	; 0xf8b4 <putch>
    fcf0:	00 e0       	ldi	r16, 0x00	; 0
    fcf2:	10 e0       	ldi	r17, 0x00	; 0
		length.byte[0] = getch();
    fcf4:	80 91 08 02 	lds	r24, 0x0208	; 0x800208 <length>
    fcf8:	90 91 09 02 	lds	r25, 0x0209	; 0x800209 <length+0x1>
#if defined(__AVR_ATmega128__) || defined(__AVR_ATmega1280__)
		if (address.word>0x7FFF) flags.rampz = 1;		// No go with m256, FIXME
		else flags.rampz = 0;
#endif
		address.word = address.word << 1;	        // address * 2 -> byte location
    fcfc:	08 17       	cp	r16, r24
    fcfe:	19 07       	cpc	r17, r25
    fd00:	40 f5       	brcc	.+80     	; 0xfd52 <block_done+0xae>
    fd02:	20 91 0c 02 	lds	r18, 0x020C	; 0x80020c <flags>
    fd06:	80 91 06 01 	lds	r24, 0x0106	; 0x800106 <address>
    fd0a:	90 91 07 01 	lds	r25, 0x0107	; 0x800107 <address+0x1>
    fd0e:	20 ff       	sbrs	r18, 0
		if (getch() == 'E') flags.eeprom = 1;
    fd10:	02 c0       	rjmp	.+4      	; 0xfd16 <block_done+0x72>
    fd12:	33 d0       	rcall	.+102    	; 0xfd7a <eeprom_read_byte>
    fd14:	04 c0       	rjmp	.+8      	; 0xfd1e <block_done+0x7a>
    fd16:	21 fd       	sbrc	r18, 1
    fd18:	03 c0       	rjmp	.+6      	; 0xfd20 <block_done+0x7c>
    fd1a:	fc 01       	movw	r30, r24
    fd1c:	84 91       	lpm	r24, Z
    fd1e:	ca dd       	rcall	.-1132   	; 0xf8b4 <putch>
		else flags.eeprom = 0;
    fd20:	80 91 06 01 	lds	r24, 0x0106	; 0x800106 <address>
    fd24:	90 91 07 01 	lds	r25, 0x0107	; 0x800107 <address+0x1>
		if (getch() == ' ') {		                // Command terminator
    fd28:	01 96       	adiw	r24, 0x01	; 1
    fd2a:	90 93 07 01 	sts	0x0107, r25	; 0x800107 <address+0x1>
    fd2e:	80 93 06 01 	sts	0x0106, r24	; 0x800106 <address>
			putch(0x14);
    fd32:	0f 5f       	subi	r16, 0xFF	; 255
    fd34:	1f 4f       	sbci	r17, 0xFF	; 255
			for (w=0;w < length.word;w++) {		        // Can handle odd and even lengths okay
    fd36:	de cf       	rjmp	.-68     	; 0xfcf4 <block_done+0x50>
    fd38:	85 37       	cpi	r24, 0x75	; 117
    fd3a:	71 f4       	brne	.+28     	; 0xfd58 <block_done+0xb4>
    fd3c:	d4 dd       	rcall	.-1112   	; 0xf8e6 <getch>
    fd3e:	80 32       	cpi	r24, 0x20	; 32
    fd40:	71 f4       	brne	.+28     	; 0xfd5e <block_done+0xba>
    fd42:	84 e1       	ldi	r24, 0x14	; 20
    fd44:	b7 dd       	rcall	.-1170   	; 0xf8b4 <putch>
    fd46:	8e e1       	ldi	r24, 0x1E	; 30
				if (flags.eeprom) {	                        // Byte access EEPROM read
    fd48:	b5 dd       	rcall	.-1174   	; 0xf8b4 <putch>
    fd4a:	86 e9       	ldi	r24, 0x96	; 150
    fd4c:	b3 dd       	rcall	.-1178   	; 0xf8b4 <putch>
    fd4e:	8a e0       	ldi	r24, 0x0A	; 10
    fd50:	b1 dd       	rcall	.-1182   	; 0xf8b4 <putch>
    fd52:	80 e1       	ldi	r24, 0x10	; 16
    fd54:	af dd       	rcall	.-1186   	; 0xf8b4 <putch>
    fd56:	7e ce       	rjmp	.-772    	; 0xfa54 <main+0x4e>
					while(EECR & (1<<EEPE));
					EEAR = (uint16_t)(void *)address.word;
					EECR |= (1<<EERE);
					putch(EEDR);
#else
					putch(eeprom_read_byte((void *)address.word));
    fd58:	86 37       	cpi	r24, 0x76	; 118
    fd5a:	09 f4       	brne	.+2      	; 0xfd5e <block_done+0xba>
    fd5c:	e4 ce       	rjmp	.-568    	; 0xfb26 <main+0x120>
#endif
					address.word++;
				}
				else {

					if (!flags.rampz) putch(pgm_read_byte_near(address.word));
    fd5e:	80 91 04 01 	lds	r24, 0x0104	; 0x800104 <error_count>
    fd62:	8f 5f       	subi	r24, 0xFF	; 255
    fd64:	80 93 04 01 	sts	0x0104, r24	; 0x800104 <error_count>
    fd68:	85 30       	cpi	r24, 0x05	; 5
#if defined(__AVR_ATmega128__) || defined(__AVR_ATmega1280__)
					else putch(pgm_read_byte_far(address.word + 0x10000));
					// Hmmmm, yuck  FIXME when m256 arrvies
#endif
					address.word++;
    fd6a:	09 f0       	breq	.+2      	; 0xfd6e <block_done+0xca>
    fd6c:	73 ce       	rjmp	.-794    	; 0xfa54 <main+0x4e>
    fd6e:	e0 91 02 01 	lds	r30, 0x0102	; 0x800102 <__data_end>
    fd72:	f0 91 03 01 	lds	r31, 0x0103	; 0x800103 <__data_end+0x1>
    fd76:	09 95       	icall
    fd78:	6d ce       	rjmp	.-806    	; 0xfa54 <main+0x4e>

0000fd7a <eeprom_read_byte>:
    fd7a:	f9 99       	sbic	0x1f, 1	; 31
		address.word = address.word << 1;	        // address * 2 -> byte location
		if (getch() == 'E') flags.eeprom = 1;
		else flags.eeprom = 0;
		if (getch() == ' ') {		                // Command terminator
			putch(0x14);
			for (w=0;w < length.word;w++) {		        // Can handle odd and even lengths okay
    fd7c:	fe cf       	rjmp	.-4      	; 0xfd7a <eeprom_read_byte>
    fd7e:	92 bd       	out	0x22, r25	; 34
    fd80:	81 bd       	out	0x21, r24	; 33
		}
	}


	/* Get device signature bytes  */
	else if(ch=='u') {
    fd82:	f8 9a       	sbi	0x1f, 0	; 31
    fd84:	99 27       	eor	r25, r25
		if (getch() == ' ') {
    fd86:	80 b5       	in	r24, 0x20	; 32
    fd88:	08 95       	ret

0000fd8a <eeprom_write_byte>:
    fd8a:	26 2f       	mov	r18, r22

0000fd8c <eeprom_write_r18>:
    fd8c:	f9 99       	sbic	0x1f, 1	; 31
			putch(0x14);
    fd8e:	fe cf       	rjmp	.-4      	; 0xfd8c <eeprom_write_r18>
    fd90:	1f ba       	out	0x1f, r1	; 31
    fd92:	92 bd       	out	0x22, r25	; 34
			putch(SIG1);
    fd94:	81 bd       	out	0x21, r24	; 33
    fd96:	20 bd       	out	0x20, r18	; 32
    fd98:	0f b6       	in	r0, 0x3f	; 63
			putch(SIG2);
    fd9a:	f8 94       	cli
    fd9c:	fa 9a       	sbi	0x1f, 2	; 31
    fd9e:	f9 9a       	sbi	0x1f, 1	; 31
			putch(SIG3);
    fda0:	0f be       	out	0x3f, r0	; 63
    fda2:	01 96       	adiw	r24, 0x01	; 1
    fda4:	08 95       	ret

0000fda6 <_exit>:
			putch(0x10);
    fda6:	f8 94       	cli

0000fda8 <__stop_program>:
    fda8:	ff cf       	rjmp	.-2      	; 0xfda8 <__stop_program>
